In [2]:
#project
import pandas as pd 
import numpy as np
card=pd.read_csv('ccard.csv')
card.head()

   index                   City       Date  Card Type Exp Type Gender  Amount
0      0           Delhi, India  29-Oct-14       Gold    Bills      F   82475
1      1  Greater Mumbai, India  22-Aug-14   Platinum    Bills      F   32555
2      2       Bengaluru, India  27-Aug-14     Silver    Bills      F  101738
3      3  Greater Mumbai, India  12-Apr-14  Signature    Bills      F  123424
4      4       Bengaluru, India   5-May-15       Gold    Bills      F  171574

In [3]:
card.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26052 entries, 0 to 26051
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   index      26052 non-null  int64
 1   City       26052 non-null  object
 2   Date       26052 non-null  object
 3   Card Type  26052 non-null  object
 4   Exp Type   26052 non-null  object
 5   Gender     26052 non-null  object
 6   Amount     26052 non-null  int64
dtypes: int64(2), object(5)
memory usage: 1.4+ MB

In [4]:
card.isnull().sum()

index        0
City         0
Date         0
Card Type    0
Exp Type     0
Gender       0
Amount       0
dtype: int64

In [5]:
card.duplicated().sum()

0

In [6]:
card.describe()

              index         Amount
count  26052.000000   26052.000000
mean   13025.500000  156411.537425
std     7520.708943  103063.254287
min        0.000000    1005.000000
25%     6512.750000   77120.250000
50%    13025.500000  153106.500000
75%    19538.250000  228050.000000
max    26051.000000  998077.000000

In [7]:
card.drop('index',inplace=True,axis=1)

In [8]:
card.tail(10)

                   City       Date  Card Type Exp Type Gender  Amount
26042  Hyderabad, India  15-Jan-15     Silver   Travel      M  194550
26043  Hyderabad, India  15-May-15     Silver   Travel      F  280335
26044    Kolkata, India  14-Oct-14       Gold   Travel      M  243249
26045    Kolkata, India  26-Feb-14  Signature   Travel      F  170049
26046  Hyderabad, India   9-Oct-13  Signature   Travel      M  198903
26047    Kolkata, India  22-Jun-14     Silver   Travel      F  128191
26048       Pune, India   3-Aug-14  Signature   Travel      M  246316
26049  Hyderabad, India  16-Jan-15     Silver   Travel      M  265019
26050     Kanpur, India  14-Sep-14     Silver   Travel      M   88174
26051  Hyderabad, India  19-Oct-13  Signature    Bills      M  184410

In [9]:
card.shape

(26052, 6)

In [10]:
card.columns

Index(['City', 'Date', 'Card Type', 'Exp Type', 'Gender', 'Amount'], dtype='object')

In [11]:
# Basic statistical info
card.describe().T

,count,mean,std,min,25%,50%,75%,max
Amount,26052.0,156411.537425,103063.254287,1005.0,77120.25,153106.5,228050.0,998077.0

In [12]:
# Basic statistical info of object columns
card.describe(include="object").T

           count unique               top   freq
City       26052    986  Bengaluru, India   3552
Date       26052    600         20-Sep-14     65
Card Type  26052      4            Silver   6840
Exp Type   26052      6              Food   5463
Gender     26052      2                 F  13680

In [13]:
# Changing Dtype of date and Extracting Month name, day name, weekday from Date 

from datetime import datetime as dt
card["Date"]=pd.to_datetime(card["Date"])
card["Month"]=card["Date"].dt.month_name()
card["Day"]=card["Date"].dt.day_name()
card.sample(2)

C:\Users\VAISHNAVI R\AppData\Local\Temp\ipykernel_10944\4242937625.py:4: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  card["Date"]=pd.to_datetime(card["Date"])

,City,Date,Card Type,Exp Type,Gender,Amount,Month,Day
5167,"Bengaluru, India",2015-03-14,Silver,Food,F,265386,March,Saturday
1706,"Delhi, India",2015-04-25,Gold,Food,M,175390,April,Saturday

In [14]:
# Lets split country and city 
card["City"]=card["City"].str.split(",",expand=True)[0]
card.sample(2)

            City       Date Card Type Exp Type Gender  Amount   Month     Day
10755      Delhi 2014-08-01      Gold    Bills      M  124630  August  Friday
6380   Ahmedabad 2014-05-25    Silver     Fuel      M  206505     May  Sunday